#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.function_lollipop.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (25 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02"
        name                                           = "io-p-itn-auth-lollipop-func-02"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_lollipop.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (26 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_lollipop.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Insights/metricAlerts/io-p-itn-auth-lollipop-func-02] Health Check Failed"
        name                = "io-p-itn-auth-lollipop-func-02] Health Check Failed"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-lollipop-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-lollipop-rg-02"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_lollipop_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lollipop-as-02" -> (known after apply)
      ~ location            = "italynorth" # forces replacement -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-lollipop-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      - profile {
          - name = "wallet_ga" -> null

          - capacity {
              - default = 20 -> null
              - maximum = 30 -> null
              - minimum = 15 -> null
            }

          - fixed_date {
              - end      = "2024-12-04T21:30:00Z" -> null
              - start    = "2024-12-04T08:00:00Z" -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = true -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Max" -> null
                  - threshold                = 3000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = true -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 300 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Max" -> null
                  - threshold                = 35 -> null
                  - time_aggregation         = "Maximum" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 4 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 15 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT2M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }
    }

  # module.function_lv_autoscale.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lv-as-02"
        name                = "io-p-itn-auth-lv-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      - profile {
          - name = "wallet_ga" -> null

          - capacity {
              - default = 20 -> null
              - maximum = 30 -> null
              - minimum = 6 -> null
            }

          - fixed_date {
              - end      = "2024-12-04T21:30:00Z" -> null
              - start    = "2024-12-04T08:00:00Z" -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = true -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Max" -> null
                  - threshold                = 2500 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = true -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 200 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Max" -> null
                  - threshold                = 35 -> null
                  - time_aggregation         = "Maximum" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 3 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 15 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT20M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (30 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service_plan.shared_plan_itn,
  on data.tf line 35, in data "azurerm_app_service_plan" "shared_plan_itn":
  35: data "azurerm_app_service_plan" "shared_plan_itn" {

The `azurerm_app_service_plan` data source has been superseded by the
`azurerm_service_plan` data source. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
